Repository: LandRegistry/digital-register-frontend-public-version
Catalog: service/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Summary of caution title
cy: Crynodeb o deitl rhybuddiad

source: Summary of title
cy: Crynodeb o deitl

source: Summary of
cy: Crynodeb

source: title
cy: deitl

source: This title was last changed on
cy: Newidiwyd y teitl hwn ddiwethaf ar

source: at
cy: am

source: Title number
cy: Rhif teitl

source: Owner
cy: Perchennog

source: Lender
cy: Rhoddwr benthyg

source: Tenure type
cy: Math o ddaliadaeth

source: Price paid/stated
cy: Pris a dalwyd/datganwyd

source: You'll only be able to view this information once
cy: Byddwch ond yn gallu gweld y wybodaeth hon unwaith

source: If you want to keep a copy, you'll need to print it out or take a screen shot.
cy: Os ydych chi am gadw copi , bydd angen i chi ei hargraffu neu gymryd ergyd sgrin

source: Print this page
cy: Argraffu’r dudalen hon

source: This map shows the property's rough extent and location, <b>not legal boundaries.</b>
cy: Mae’r map hwn yn dangos maint a lleoliad bras yr eiddo, <b>nid terfynau cyfreithiol</b>

source: If you have any problems with your purchase, you can call Land Registry on
cy: Os oes gennych unrhyw broblemau gyda'ch pryniant , gallwch ffonio Gofrestrfa Tir ar

source: For more contact methods, visit
cy: I gael mwy o ddulliau cyswllt, ewch i

source: What next
cy: Beth nesaf

source: Search for another title using this service
cy: Chwilio am deitl arall gan ddefnyddio’r gwasanaeth hwn

source: Return to
cy: Yn ôl i
